Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t
Struct for the pick event data.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.ObjectsSizeConst
The constant size of the Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.aObjectIds array.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.PointsSizeConst
The constant size of the Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.aPoints array.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.PickType
The type of the picking operation.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.nObjectIds
The number of object identifiers.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.aObjectIds
The array of object identifiers.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.nPoints
The number of points.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t.aPoints
The array of points.